{
    "name": "Alice Stein",
    "contact": {
        "email": "stein.jobs@proton.me",
        "linkedin": "https://www.linkedin.com/in/alice-stein/",
        "linkedin_display": "linkedin.com/in/alice-stein",
        "github": "https://github.com/acstein",
        "github_display": "github.com/alice-stein",
        "location": "UK"
    },
    "summary": "Alice Stein - Predictive Modelling Analyst @ DSTL | MChem(Hons)",
    "base_url": "None",
    "technical_skills": [
        {
            "display_name": "Programming & Data",
            "skills": [
                "Python",
                "HPC (Slurm)",
                "Bash",
                "Data Analysis & Visulisation"
            ]
        },
        {
            "display_name": "Modelling & Simulation",
            "skills": [
                "Predictive Modelling",
                "Reinforcement Learning",
                "Statistics",
                "ML",
                "Assurance Frameworks"
            ]
        },
        {
            "display_name": "Tools & Libraries",
            "skills": [                
                "Pandas",
                "Matplotlib",
                "Pytest",
                "Git",
                "Dashboards (Dash, Streamlit, Tkinter)",
                "Tensorflow",
                "PyTorch"
            ]
        }
    ],
    "work_experience": [
        {
            "company": "Royal Navy's Operational Advantage Centre (Dstl)",
            "positions": [
                {
                    "role": "Senior Modelling & Simulation Analyst",
                    "start_date": "December 2023",
                    "end_date": "Present"
                }
            ],
            "experiences": [
                "Leading high-throughput analysis for a multi-million-pound programme using HPC modelling workflows built with Python and Slurm.",
                "Influencing decision making within the Navy, by delivering high-impact briefings to senior military ranks, such the First Sea Lord (4*), leading to company wide recognition by receiving “Most Impactful OA Award”.",
                "Provided operational advice in high-pressure contexts, enabling rapid, evidence-based decisions, which was recognised via CDO Commendation.",
                "Oversaw the development of an OpenAI Gymnasium interface to integrate reinforcement learning for tactical insight generation within modelling software.",
                "Built end-to-end custom data processing and visualisation tools (GUIs) to improve communication of complex modelling results to diverse stakeholders.",
                "Established and ran Python learning groups, mentoring junior scientists, encouraging peer-assisted learning, and promoting code review culture.",
                "Founded a female analyst support group, fostering confidence and leadership.",
                "Introduced assurance frameworks to ensure quality analysis and code (AQUA book)."
            ]
        },
        {
            "company": "Defence Science and Technology Laboratories - MOD",
            "positions": [
                {
                    "role": "Chemical Scientist",
                    "start_date": "March 2022",
                    "end_date": "December 2023"
                }
            ],
            "experiences": [
                "Automated manual analysis of large datasets using Python (Pandas, Matplotlib), significantly reducing time and human error.",
                "Supported and participated in multiple trials involving chemical/biological warfare agents, which required high precision and effective teamwork.",
                "Spearheaded a migration from Excel to a robust proprietary database system, engaging stakeholders across the organisation to facilitate adoption.",
                "Designed and conducted experimental research, gathering empirical evidence to support mathematical modelling. Extracted data from imaging using Python analysis and presented findings at an international fluid dynamics conference (APS DFD).",
                "Translated customer requirements into technical specifications for development of statistical sampling software, culminating in successful pre-deployment testing.",
                "Delivered and continuously improved military training courses, incorporating storytelling and interactive methods to convey complex scientific principles to end-users."
            ]
        }
    ],
    "projects": [
        {
            "name": "Strava LLM Coach",
            "link": "",
            "points": [
                "Streamlit app connecting Strava data to OpenAI APIs written in Python",
                "Features: data pipeline, API calls, interactive dashboard",
                "Version control with Git"
            ]
        },
        {
            "name": "Advent of Code",
            "link": "",
            "points": [
                "Led a continuous improvment group to go through Advent of Code solutions.",
                "Sharing of best pratice and diverse approaches to problem solving."
            ]
        }
    ],
    "education": {
        "degree": "MChem(Hons) Chemistry with Industrial Placement",
        "degree_result": "First Class Honours",
        "university": "University of Bath",
        "degree_start_date": 2017,
        "degree_end_date": 2021,
        "alevels": [
            "Maths A*",
            "Biology A*",
            "Chemistry A"
        ],
        "gcses": "8A*s, 2As"
    }
}